In [1]:
import numpy as np
import pandas as pd

In [12]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [10]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(data= my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [22]:
pd.Series(data=[sum,len])

0    <built-in function sum>
1    <built-in function len>
dtype: object

In [30]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [24]:
ser1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [26]:
ser2= pd.Series([1,2,5,4,],['USA','Germany','Italy','Japan'])

In [31]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [32]:
ser2['Italy']

5

In [33]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [34]:
from numpy.random import randn

In [36]:
np.random.seed(101)

In [38]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [39]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [45]:
randn(4,4)

array([[ 0.39248881,  0.22149069, -0.85519604,  1.54199041],
       [ 0.66631932, -0.53823463, -0.56858136,  1.40733825],
       [ 0.64180551, -0.9050999 , -0.39115663,  1.02829316],
       [-1.9726051 , -0.86688504,  0.7207876 , -1.22308204]])

In [46]:
df["W"]

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [47]:
type(df["W"])

pandas.core.series.Series

In [51]:
df[["W",'Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [53]:
df['new'] = df['W'] + df['Y']

In [54]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [58]:
df.drop('new',axis = 1,inplace = True)

In [61]:
df.drop('E',axis = 0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [62]:
df.shape

(5, 4)

In [66]:
df.loc['C']

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [64]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [68]:
df.loc["B",'Y']

0.16690463609281317

In [69]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [70]:
df.iloc[0,0]

0.30266544858518252

In [71]:
df.loc[['C','E'],['Y','W']]

          Y         W
C  0.638787  0.807706
E  0.238127 -0.116773

In [72]:
 df >1

       W      X      Y      Z
A  False   True  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True  False   True

In [74]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [75]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [78]:
df["W"]>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [79]:
df[df["W"]>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [80]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [83]:
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119